Торговля_11__демо/src/AccumulationRegisters/ДвиженияСерийТоваров/ДвиженияСерийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияСерийТоваров</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.АктОРасхожденияхПослеПеремещения</types>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.ОтчетОбИмпортеЕГАИС</types>
      <types>DocumentRef.АктОРасхожденияхПослеОтгрузки</types>
      <types>DocumentRef.ИсходящаяТранспортнаяОперацияВЕТИС</types>
      <types>DocumentRef.ТТНВходящаяЕГАИС</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.ЗапросСкладскогоЖурналаВЕТИС</types>
      <types>DocumentRef.ПроизводственнаяОперацияВЕТИС</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ЧекЕГАИСВозврат</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВходящаяТранспортнаяОперацияВЕТИС</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ОтгрузкаТоваровСХранения</types>
      <types>DocumentRef.ОрдерНаОтражениеПересортицыТоваров</types>
      <types>DocumentRef.ОформлениеСДИЗЗЕРНО</types>
      <types>DocumentRef.АктОРасхожденияхПослеПриемки</types>
      <types>DocumentRef.ЧекЕГАИС</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.КорректировкаИзлишковНедостачПоТоварнымМестам</types>
      <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
      <types>DocumentRef.ТТНИсходящаяЕГАИС</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ЧекККМКоррекции</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.АктПостановкиНаБалансЕГАИС</types>
      <types>DocumentRef.ФормированиеПартийИзДругихПартийЗЕРНО</types>
      <types>DocumentRef.ФормированиеПартийЗЕРНО</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.ОрдерНаОтражениеИзлишковТоваров</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ОрдерНаОтражениеНедостачТоваров</types>
      <types>DocumentRef.ОрдерНаОтражениеПорчиТоваров</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ИнвентаризацияПродукцииВЕТИС</types>
      <types>DocumentRef.ОтчетОПроизводствеЕГАИС</types>
      <types>DocumentRef.АктСписанияЕГАИС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ПересортицаТоваровУХранителя</types>
      <types>DocumentRef.КорректировкаПоОрдеруНаТовары</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ЗапросОстатковПартийЗЕРНО</types>
      <types>DocumentRef.ПересчетТоваров</types>
      <types>DocumentRef.СписаниеПартийЗЕРНО</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.ПередачаВРегистр2ЕГАИС</types>
      <types>DocumentRef.ОтчетОСписанииТоваровУХранителя</types>
      <types>DocumentRef.ОтборРазмещениеТоваров</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>DocumentRef.ФормированиеПартийПриПроизводствеЗЕРНО</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ВнесениеСведенийОСобранномУрожаеЗЕРНО</types>
      <types>DocumentRef.ПогашениеСДИЗЗЕРНО</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ВозвратИзРегистра2ЕГАИС</types>
      <types>DocumentRef.ВыкупТоваровХранителем</types>
      <types>DocumentRef.ОрдерНаПеремещениеТоваров</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваровУХранителя</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПорчаТоваровУХранителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПомещениеОтправителя</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладскаяОперация</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПомещениеПолучателя</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПолучателя</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоСкладскоеДвижение</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Торговля_11__демо/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>КонтрольОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ДвижениеВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииВПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ОтборИзЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВРозницу</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектовДляРазборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектующихДляСборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНаВнутренниеНужды</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоВозвратуПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеИзлишков</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеНедостач</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеПорчи</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеРезультатовПересчетов</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуПомещениями</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоПриемка</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>Пересчет</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомплектующихПослеРазборки</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваПриемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоВозвратуОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПрочемуОприходованию</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСобранныхКомплектов</name>
  </enumValues>
  <enumValues>
    <name>РазмещениеВЯчейки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваровУстарел</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеМатериаловПриПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаПродукцииДляГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаТМЦВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВыбытиеТМЦИзЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ИнвентаризацияТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСЗЕРНО</name>
    <comment>Серии, попавшие в документы интеграции с ФГИС &quot;Зерно&quot;</comment>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Documents/ОрдерНаОтражениеПересортицыТоваров/ОрдерНаОтражениеПересортицыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОрдерНаОтражениеПересортицыТоваров</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОприходование</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаОприходование</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияОприходование</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийОприходование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОприходование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Торговля_11__демо/src/AccumulationRegisters/ДвиженияСерийТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - См. ПроведениеДокументов.СвойстваДокумента
//
// Возвращаемое значение:
//  Структура - См. ПроведениеДокументов.ПараметрыУчетногоМеханизма
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров);
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Возвращает тексты запросов для сторнирования движений при исправлении документов
// 
// Параметры:
// 	МетаданныеДокумента - ОбъектМетаданныхДокумент - Метаданные документа, который проводится.
// 
// Возвращаемое значение:
// 	Соответствие - Соответствие полного имени регистра тексту запроса сторнирования
//
Функция ТекстыЗапросовСторнирования(МетаданныеДокумента) Экспорт
	
	ДвиженияДокумента = МетаданныеДокумента.Движения;

	ТекстыЗапросов = Новый Соответствие();
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ДвиженияСерийТоваров;
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(),
			ПроведениеДокументов.ТекстСторнирующегоЗапроса(
				МетаданныеРегистра, МетаданныеДокумента));
	КонецЕсли;
	
	Возврат ТекстыЗапросов;
	
КонецФункции

// Процедура формирования движений по регистру.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ДвиженияСерийТоваров");
	
КонецПроцедуры

// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие - соответствие имен таблиц изменения регистров и текстов запросов.
//	
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	(ЗначениеРазрешено(Отправитель)
	|		И ТипЗначения(Отправитель) = Тип(Справочник.Склады))
	|	ИЛИ (ЗначениеРазрешено(Получатель)
	|		И ТипЗначения(Получатель) = Тип(Справочник.Склады))"

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.ДвиженияСерийТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.11.47";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9557ebd6-94e6-44f4-830f-4eabf8c33c1e");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ДвиженияСерийТоваров.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Обновляет движения документов информационной базы по регистру накопления ""Движения серий товаров"".
									|До завершения выполнения обработчика работа с документами не рекомендуется, т.к. информация в регистре некорректна.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ОрдерНаОтражениеПересортицыТоваров.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ОрдерНаОтражениеПорчиТоваров.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПорчаТоваров.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПорчаТоваровУХранителя.ПолноеИмя());
	
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров.ПолноеИмя());
	
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров.ПолноеИмя());
	
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

// Параметры:
//	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.ДвиженияСерийТоваров;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить("Документ.ОрдерНаОтражениеПересортицыТоваров");
	СписокДокументов.Добавить("Документ.ОрдерНаОтражениеПорчиТоваров");
	СписокДокументов.Добавить("Документ.ПорчаТоваров");
	СписокДокументов.Добавить("Документ.ПорчаТоваровУХранителя");
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = СтрСоединить(СписокДокументов, ",");
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяОбъекта;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПараметрыВыборки.ПолныеИменаРегистров;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОрдерНаОтражениеПересортицыТоваров.Товары КАК ТоварыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОрдерНаОтражениеПересортицыТоваров ДанныеДокумента
	|		ПО ТоварыДокумента.Ссылка = ДанныеДокумента.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДанныеРегистра
	|		ПО ТоварыДокумента.Ссылка = ДанныеРегистра.Документ
	|			И ТоварыДокумента.НоменклатураОприходование = ДанныеРегистра.Номенклатура
	|			И ДанныеДокумента.Помещение <> ДанныеРегистра.ПомещениеПолучателя
	|ГДЕ
	|	ТоварыДокумента.Ссылка.Проведен
	|	И НЕ ДанныеРегистра.Документ ЕСТЬ NULL
	|	И ДанныеДокумента.Помещение <> ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|	И ТоварыДокумента.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОрдерНаОтражениеПорчиТоваров.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДанныеРегистра
	|		ПО Товары.Ссылка = ДанныеРегистра.Документ
	|			И Товары.НоменклатураОприходование = ДанныеРегистра.Получатель
	|ГДЕ
	|	Товары.Ссылка.Проведен
	|	И НЕ ДанныеРегистра.Документ ЕСТЬ NULL
	|	И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПорчаТоваров.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДанныеРегистра
	|		ПО Товары.Ссылка = ДанныеРегистра.Документ
	|			И ДанныеРегистра.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтражениеНедостач)
	|ГДЕ
	|	Товары.Ссылка.Проведен
	|	И НЕ ДанныеРегистра.Документ ЕСТЬ NULL
	|	И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПорчаТоваровУХранителя.Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДанныеРегистра
	|		ПО Товары.Ссылка = ДанныеРегистра.Документ
	|			И ДанныеРегистра.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтражениеНедостач)
	|ГДЕ
	|	Товары.Ссылка.Проведен
	|	И НЕ ДанныеРегистра.Документ ЕСТЬ NULL
	|	И Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазыУТ.ДополнительныеПараметрыПерезаписиДвиженийИзОчереди();
	ДополнительныеПараметры.ОбновляемыеДанные = Параметры.ОбновляемыеДанные;
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ОрдерНаОтражениеПересортицыТоваров");
	Регистраторы.Добавить("Документ.ОрдерНаОтражениеПорчиТоваров");
	Регистраторы.Добавить("Документ.ПорчаТоваров");
	Регистраторы.Добавить("Документ.ПорчаТоваровУХранителя");
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы,
		"РегистрНакопления.ДвиженияСерийТоваров",
		Параметры.Очередь,
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
